УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="07a989fe-b7de-44b6-839d-e1cce1d2d423">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4b318cc3-2f5c-4b35-9733-92b8480d218b">
    <name>смартЛогинНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45c407b4-0b68-47cd-a142-a06f4a184f90">
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67d2f639-09f9-487b-aefa-c42471c9026b">
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1507bf85-d479-4d4c-b34f-ae3f3fbe92d0">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/смартИдентификаторыСоответствияБитрикс/смартИдентификаторыСоответствияБитрикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e73d00f7-5769-4608-9c25-45cef0769d61">
  <name>смартИдентификаторыСоответствияБитрикс</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="1108660d-814d-4d98-bdc2-94a89bc145c5">
    <name>ГУИД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="b4ff496b-7478-4e3c-a3d5-a8943f81b5e7">
    <name>СсылкаМет</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bcf78ec-daf5-4eac-b38c-85fe3f01e92c">
    <name>ИДсайта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/Forms/CRM_ФормаЭлементаНовая/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 11.03.2021 15:55:55- задача 552
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	Элемент = Элементы.Добавить("смартЭлектроннаяПочтаНаСайте", Тип("ПолеФормы"),Элементы.ГруппаДополнительно);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.МаксимальнаяШирина=30;
	Элемент.АвтоМаксимальнаяШирина=Ложь;
	Элемент.ПутьКДанным = "Объект.смартЭлектроннаяПочтаНаСайте";
	
	Элемент1 = Элементы.Добавить("смартЛогинНаСайте", Тип("ПолеФормы"),Элементы.ГруппаДополнительно);
	Элемент1.Вид = ВидПоляФормы.ПолеВвода;
	Элемент1.МаксимальнаяШирина=30;
	Элемент1.АвтоМаксимальнаяШирина=Ложь;
	Элемент1.ПутьКДанным = "Объект.смартЛогинНаСайте";
	
	Элемент2 = Элементы.Добавить("смартТелефонНаСайте", Тип("ПолеФормы"),Элементы.ГруппаДополнительно);
	Элемент2.Вид = ВидПоляФормы.ПолеВвода;
	Элемент2.Заголовок="Телефон на сайте";
	Элемент2.МаксимальнаяШирина=20;
	Элемент2.АвтоМаксимальнаяШирина=Ложь;
	Элемент2.ПутьКДанным = "Объект.смартТелефонНаСайте";

	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элемент.ТолькоПросмотр = Истина;
		Элемент1.ТолькоПросмотр = Истина;
		Элемент2.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)  И РольДоступна("ПолныеПрава") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	смартИдентификаторыСоответствияБитрикс.ИДсайта КАК ИДсайта
		|ИЗ
		|	РегистрСведений.смартИдентификаторыСоответствияБитрикс КАК смартИдентификаторыСоответствияБитрикс
		|ГДЕ
		|	смартИдентификаторыСоответствияБитрикс.СсылкаМет = &СсылкаМет";
		
		
		Запрос.УстановитьПараметр("СсылкаМет", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартИдКонтактного", Тип("ДекорацияФормы"),Элементы.ГруппаДополнительно);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.ЦветТекста=Новый Цвет(0,194,0);
			НовыйЭлемент.Заголовок = ВыборкаДетальныеЗаписи.ИДсайта;
		КонецЕсли;
		
	КонецЕсли; 
	
	//++#1012 смарт: Холопов 04.05.2022 // Добавление подсказок для программно добавленных элементов и телефонов в КИ 
	Элемент2.ПодсказкаВвода = "+7 ХХХ ХХХ ХХ ХХ БЕЗ ПРОБЕЛОВ";
	Элемент2.Подсказка = "Если номер имеет заграничный формат, нажмите на кнопку выбора или F4 и введите номер";
	Элемент2.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;   
	
	Элемент.УстановитьДействие("ПриИзменении", "смартЭлектроннаяПочтаНаСайтеПриИзменении");
	//Поля КИ создаются только при создании на сервере нового объекта. У существующего объекта поля создаются по кнопке "Изменить"
	смартОбщегоНазначения.ДобавитьПодсказкиКонтактнаяИнформация(ЭтотОбъект);
	//--#1012 смарт: Холопов 04.05.2022
	
	//++ #1813 смарт: Фролов 08.05.2024 //Доработки для удобства использования WhatsApp
	Элементы.БыстрыйВвод_Чат.Заголовок = "WhatsApp";
	НовыйЭлемент = Элементы.Добавить("смартДекорацияНетПолучателейЧата", Тип("ДекорацияФормы"), Элементы.БыстрыйВвод_СтраницаЧат);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт, , , Истина);
	НовыйЭлемент.Заголовок = "   Нет возможности отправить сообщение WhatsApp!" + Символы.ПС
		+ "Нет Контактных лиц партнера с указанным мобильным телефом!";
	НовыйЭлемент.ЦветТекста = Новый Цвет(255,0,0);
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	//-- #1813 смарт: Фролов 08.05.2024
	
	//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка "Личный кабинет" 
	НовыйЭлемент = Элементы.Добавить("смартИдентификаторБитрикс", Тип("ПолеФормы"), Элементы.ГруппаДополнительно);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.смартИдентификаторБитрикс";
	
	НовыйЭлемент = Элементы.Добавить("смартАктивностьНаСайте", Тип("ПолеФормы"), Элементы.ГруппаДополнительно);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.смартАктивностьНаСайте";
	//-- #Б3686 смарт: Шляпников 03.07.202
	
	//++ #1830 смарт: Фролов 23.05.2024 //Приведение механизма Заметок в Интересе и Партнере к общему виду.
	Элементы.БыстрыйВвод_Примечание.Заголовок = "Заметки";
	//-- #1830 смарт: Фролов 23.05.2024
	
	//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
	МассивРеквизитов = Новый Массив;
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("БыстрыйВвод_ЗадачаСмартВидЗадачи", 
	Новый ОписаниеТипов("СправочникСсылка.смартВидыЗадач"), , "Вид задачи"));
	
	ИзменитьРеквизиты(МассивРеквизитов);
	//-- #1929 смарт: Фролов 23.07.2024	

	//++ #Б-1998 смарт: Лопато 27.01.2025 //Создание пользователя ИМ на основании договора поставки. Доработать метод отправки регистрации на сайт  
	Если Пользователи.ЭтоПолноправныйПользователь() 
		 И Константы.смартКонтактныеЛицаНаСайтБитрикс.Получить() Тогда
	
		НоваяКоманда = Команды.Добавить("смартЗарегистрироватьПользователяНаСайте");
		НоваяКоманда.Действие = "смартЗарегистрироватьПользователяНаСайте";
		НоваяКоманда.Отображение = ОтображениеКнопки.Текст;
		НоваяКоманда.Заголовок = "Зарегистрировать на сайте";
		
		НоваяКнопка = Элементы.Добавить("смартЗарегистрироватьПользователяНаСайте", Тип("КнопкаФормы"), Элементы.ГруппаДополнительно);
		НоваяКнопка.ИмяКоманды = "смартЗарегистрироватьПользователяНаСайте";
		
	КонецЕсли;	
	//-- #Б-1998 смарт: Лопато 27.01.2025
	
КонецПроцедуры

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 28.09.2021 12:51:16- задача 552
&НаСервере
Процедура смарт_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
    МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура смарт_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)

	//++#1307 смарт: Лопато 07.02.2023 //Запретить контактных лиц на "неопределенном партнере"
	Если Объект.Владелец = Справочники.Партнеры.НеизвестныйПартнер Тогда

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Запрещено оформлять документы по неопределенным партнерам!'"),
			Объект.Владелец,
			"Владелец",
			"Объект.Владелец",
			Отказ);

		Объект.Владелец = Неопределено;
		
	КонецЕсли;	
	//--#1307 смарт: Лопато 07.02.2023
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("НастроитьОбластьВводаПоСтранице")
Процедура смарт_НастроитьОбластьВводаПоСтранице(Знач ПолныйСброс)

	//Общее
	ТекущаяДата = ТекущаяДатаСеанса();
	БыстрыйВвод_ДатаНачала = ТекущаяДата;
	Если ПолныйСброс Тогда
		// При создании или отмене создания объекта.
		БыстрыйВвод_Тема = "";
		БыстрыйВвод_Содержание = "";
		Если БыстрыйВвод_Вложения.Количество() > 0 Тогда
			БыстрыйВвод_Вложения.Очистить();
			CRM_ЛентаСобытий.ОбновитьЭлементыВложений(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;

	Если БыстрыйВвод_ТекущийТипОбъекта = "Примечание" Тогда

		ТемаЗаполнена = ЗначениеЗаполнено(БыстрыйВвод_Тема);
		ВысотаТемы = ?(ТемаЗаполнена, 3, 1);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_ПримечаниеТема", "Высота", ВысотаТемы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_КомандыПримечание", "Видимость", ТемаЗаполнена);

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Взаимодействие" Тогда

		БыстрыйВвод_Тема = СтрЗаменить(БыстрыйВвод_Тема, Символы.ПС, " ");

		ДанныеВидаВзаимодействия = CRM_ЛентаСобытий.ДанныеВидаВзаимодействияПоУмолчанию("ЛентаКонтакта");
		БыстрыйВвод_ВзаимодействиеВид = ДанныеВидаВзаимодействия.Ссылка;
		Если БыстрыйВвод_Тема = "" Тогда
			БыстрыйВвод_Тема = ДанныеВидаВзаимодействия.Описание;
		КонецЕсли;

		БыстрыйВвод_ВзаимодействиеНаВесьДень = Ложь;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаНачала_Время.Видимость = Истина;
		Элементы.БыстрыйВвод_ВзаимодействиеДатаОкончания_Время.Видимость = Истина;
		БыстрыйВвод_ДатаНачала = CRM_ОбщегоНазначенияКлиентСервер.ОкруглитьДатуДоМинут(БыстрыйВвод_ДатаНачала, 30);
		БыстрыйВвод_ДатаОкончания = БыстрыйВвод_ДатаНачала + 1800;
		БыстрыйВвод_ВзаимодействиеОтправитель = ТекущийПользователь;
		БыстрыйВвод_ВзаимодействиеПолучатель = Объект.Ссылка;

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Задача" Тогда

		БыстрыйВвод_Тема = СтрЗаменить(БыстрыйВвод_Тема, Символы.ПС, " ");

		БыстрыйВвод_ЗадачаВариантСрока = Перечисления.CRM_ВариантыУстановкиДаты.ЧерезДень;
		БыстрыйВвод_ДатаОкончания = CRM_ОбщегоНазначенияКлиентСервер.ОкруглитьДатуДоМинут(ТекущаяДата, 30) + 86400;
		
		#Удаление //++ #1915 смарт: Фролов 15.07.2024 //Подставлять Ответственного/Основного менеджера получателем Задач.
		БыстрыйВвод_ЗадачаПолучатель = ТекущийПользователь;
		#КонецУдаления
		
		#Вставка
		//++ #1915 смарт: Фролов 15.07.2024 //Подставлять Ответственного/Основного менеджера получателем Задач.
		Если ЗначениеЗаполнено(Объект.Владелец.ОсновнойМенеджер) Тогда
			БыстрыйВвод_ЗадачаПолучатель = Объект.Владелец.ОсновнойМенеджер;
		Иначе
			БыстрыйВвод_ЗадачаПолучатель = ТекущийПользователь;	
		КонецЕсли;
		//-- #1915 смарт: Фролов 15.07.2024
		#КонецВставки
		
		#Вставка 
		//++ #1929 смарт: Фролов 23.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями
		Если Элементы.Найти("смартВидЗадачи") = Неопределено Тогда
			НовыйЭлемент = Элементы.Вставить("смартВидЗадачи", Тип("ПолеФормы"), Элементы.БыстрыйВвод_СтраницаЗадача, Элементы.БыстрыйВвод_ЗадачаПолучатель);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "Вид задачи";
			НовыйЭлемент.Видимость = Истина;
			НовыйЭлемент.ПутьКДанным = "БыстрыйВвод_ЗадачаСмартВидЗадачи";
		КонецЕсли;
		//-- #1929 смарт: Фролов 23.07.2024
		#КонецВставки

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Письмо" Тогда

		БыстрыйВвод_Тема = СтрЗаменить(БыстрыйВвод_Тема, Символы.ПС, " ");

		БыстрыйВвод_ПисьмоПолучатели.Очистить();
		БыстрыйВвод_ПисьмоПолучателиКопий.Очистить();
		БыстрыйВвод_ПисьмоПолучателиСкрытыхКопий.Очистить();
		БыстрыйВвод_ПисьмоСписокПолучателейПисьма = "";
		БыстрыйВвод_ПисьмоСписокПолучателейКопий = "";
		БыстрыйВвод_ПисьмоСписокПолучателейСкрытыхКопий = "";

		УчетныеЗаписиПочтыСписокВыбора = Элементы.БыстрыйВвод_ПисьмоОтправительПредставление.СписокВыбора;
		УчетныеЗаписиПочтыСписокВыбора.Очистить();
		CRM_УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписиДляОтправки(УчетныеЗаписиПочтыСписокВыбора,, ТекущийПользователь);
		Если УчетныеЗаписиПочтыСписокВыбора.Количество() > 0 Тогда
			УчетнаяЗаписьПоУмолчанию = CRM_ЛентаСобытий.УчетнаяЗаписьПоУмолчанию(ТекущийПользователь);
			ЭлементСписка = УчетныеЗаписиПочтыСписокВыбора.НайтиПоЗначению(УчетнаяЗаписьПоУмолчанию);
			Если ЭлементСписка = Неопределено Тогда
				ЭлементСписка = УчетныеЗаписиПочтыСписокВыбора[0];
			КонецЕсли;
			БыстрыйВвод_ПисьмоУчетнаяЗапись = ЭлементСписка.Значение;
			БыстрыйВвод_ПисьмоОтправительПредставление = ЭлементСписка.Представление;
		КонецЕсли;

		ВладельцыКонтактнойИнформации = Новый Массив;
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ВладельцыКонтактнойИнформации.Добавить(Объект.Ссылка);
		КонецЕсли;

		ДанныеКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		ВладельцыКонтактнойИнформации, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		БыстрыйВвод_ПисьмоИсторияАдресов.Очистить();
		Для Каждого Строка Из ДанныеКонтактнойИнформации Цикл
			ПредставлениеАдресаКонтакта = CRM_УправлениеЭлектроннойПочтой.ПолучитьПредставлениеАдресата(Строка.Объект, Строка.Представление, "");
			БыстрыйВвод_ПисьмоИсторияАдресов.Добавить(ПредставлениеАдресаКонтакта);
		КонецЦикла;

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Файл" Тогда

		ЕстьВложения = (БыстрыйВвод_Вложения.Количество() > 0);
		ВысотаТемы = ?(ЗначениеЗаполнено(БыстрыйВвод_Тема), 3, 1);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_ФайлОписание", "Высота", ВысотаТемы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БыстрыйВвод_КомандыФайл", "Видимость", ЕстьВложения);

	ИначеЕсли БыстрыйВвод_ТекущийТипОбъекта = "Чат" Тогда

		// +Рарус alexpr
		//// Если смогли переключиться на эту страницу - значит, получатели есть.
		//ПервыйПолучатель = БыстрыйВвод_ЧатПолучатели[0];
		//БыстрыйВвод_ЧатИдентификаторПолучателя = ПервыйПолучатель.Идентификатор;
		//БыстрыйВвод_ЧатАдрес = ПервыйПолучатель.Адрес;
		//БыстрыйВвод_ЧатПолучатель = ПервыйПолучатель.Контакт;
		//БыстрыйВвод_ЧатПредставлениеПолучателя = ПервыйПолучатель.Представление;
		//БыстрыйВвод_ЧатУчетнаяЗапись = ПервыйПолучатель.УчетнаяЗапись;
		//БыстрыйВвод_ЧатГруппа = ПервыйПолучатель.Группа;
		Если БыстрыйВвод_ЧатПолучатели.Количество() > 0 Тогда
			ПервыйПолучатель = БыстрыйВвод_ЧатПолучатели[0];
			БыстрыйВвод_ЧатИдентификаторПолучателя = ПервыйПолучатель.Идентификатор;
			БыстрыйВвод_ЧатАдрес = ПервыйПолучатель.Адрес;
			БыстрыйВвод_ЧатПолучатель = ПервыйПолучатель.Контакт;
			БыстрыйВвод_ЧатПредставлениеПолучателя = ПервыйПолучатель.Представление;
			БыстрыйВвод_ЧатУчетнаяЗапись = ПервыйПолучатель.УчетнаяЗапись;
			БыстрыйВвод_ЧатПредставлениеУчетнойЗаписи = ПервыйПолучатель.УчетнаяЗапись;
			БыстрыйВвод_ЧатГруппа = ПервыйПолучатель.Группа;
			БыстрыйВвод_ЧатЭтоНомерТелефона = ПервыйПолучатель.ЭтоНомерТелефона;
			БыстрыйВвод_ЧатВидКИ = ПервыйПолучатель.ВидКИ;
		КонецЕсли;
		// -Рарус alexpr

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт 

//++#1012 смарт: Холопов 04.05.2022 // Добавление проверки при вводе электронной почты и телефона
&НаКлиенте
&После("Подключаемый_КонтактнаяИнформацияНажатие")
Процедура смарт_Подключаемый_КонтактнаяИнформацияНажатие(Команда)
	
	Если СтрНайти(Команда.Имя, "КомандаИзменитьКИ") > 0 Тогда
		ЭлементСпискаКИ = Элементы.Найти(СтрЗаменить(Команда.Имя, "КомандаИзменитьКИ", "ГруппаЗаголовокКИ"));
		Если ЭлементСпискаКИ <> Неопределено Тогда
			
			Для каждого Стр Из ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
				
				Если Стр.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
					
					ЭлемНомерТелефона = ЭтотОбъект.Элементы.Найти(Стр.ИмяРеквизита);
					Если ЭлемНомерТелефона <> Неопределено Тогда
						
						ЭлемНомерТелефона.ПодсказкаВвода = "+7 ХХХ ХХХ ХХ ХХ или 8 ХХХ ХХХ ХХ ХХ БЕЗ ПРОБЕЛОВ";
						ЭлемНомерТелефона.Подсказка = "Если номер имеет заграничный формат, нажмите на кнопку выбора или F4 и введите номер";
						ЭлемНомерТелефона.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура смартЭлектроннаяПочтаНаСайтеПриИзменении(Элемент)

	Адрес = Элемент.ТекстРедактирования;
	
	Если НЕ ЗначениеЗаполнено(Адрес) Тогда
		Возврат;		
	КонецЕсли;
	
	Результат = смартПроверитьНаУникальностьСредиКЛНаСервере(Адрес);
	
	Если Результат = Истина Тогда
		Объект.смартЭлектроннаяПочтаНаСайте = "";
		Возврат;
	КонецЕсли;
	
	Результат = смартПроверитьНаУникальностьВАдресахКЛНаСервере(Адрес,Объект.Ссылка);
	
	Если Результат = Истина Тогда
		Объект.смартЭлектроннаяПочтаНаСайте = "";
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция смартПроверитьНаУникальностьВАдресахКЛНаСервере(Адрес,Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК ЭлАдрес,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Представление КАК СсылкаПредставление,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец КАК Владелец,
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец.Код КАК ВладелецКод
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление = &Представление
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("смартЭлектроннаяПочтаНаСайте", Адрес);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Представление", Адрес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Текст = "Адрес """ + Адрес + """ уже используется! Найдено совпадений:" + Символы.ПС + Символы.ПС; 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Нумерация = 1;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокаСовпадение = "" + 
			Нумерация + ") " + "Клиент: " + ВыборкаДетальныеЗаписи.Владелец + " (" + ВыборкаДетальныеЗаписи.ВладелецКод + ")" + Символы.ПС + 
			"Контактное лицо:" + ВыборкаДетальныеЗаписи.СсылкаПредставление + Символы.ПС;
			
			Текст = Текст + СтрокаСовпадение;
			
			Нумерация = Нумерация + 1;	
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();		
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции                                              

&НаСервереБезКонтекста
Функция смартПроверитьНаУникальностьСредиКЛНаСервере(Адрес)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
		|	КонтактныеЛицаПартнеров.смартЭлектроннаяПочтаНаСайте КАК смартЭлектроннаяПочтаНаСайте,
		|	КонтактныеЛицаПартнеров.Представление КАК Представление
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.ПометкаУдаления = ЛОЖЬ
		|	И КонтактныеЛицаПартнеров.смартЭлектроннаяПочтаНаСайте = &смартЭлектроннаяПочтаНаСайте";
	
	Запрос.УстановитьПараметр("смартЭлектроннаяПочтаНаСайте", Адрес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Текст = "Адрес """ + Адрес + """ уже используется контактными лицами:" + Символы.ПС; 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Текст = Текст + ВыборкаДетальныеЗаписи.Представление + Символы.ПС;
			
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();		
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//++ #1448 смарт: Фролов 17.01.2024 //Копировать номер контактного лица
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры //-- #1448 смарт: Фролов 17.01.2024

&НаСервере
//++ #1810 смарт: Фролов 08.05.2024 //Заполнение вида контактной информации КЛП - WhatsApp
Процедура смарт_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МассивМобильныхТелефонов = ТекущийОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид"
		, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица));
		
	Если МассивМобильныхТелефонов.Количество() > 0 Тогда
		
		МасивWhatsApp = ТекущийОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид"
			, Справочники.смартПредопределенныеЗначения.ВидКонтактнойИнформацииWhatsApp.Значение));
		
		Если МасивWhatsApp.Количество() = 0 Тогда
			
			СтрокаКИ = ТекущийОбъект.КонтактнаяИнформация.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКИ, МассивМобильныхТелефонов[0]);
			СтрокаКИ.Вид = Справочники.смартПредопределенныеЗначения.ВидКонтактнойИнформацииWhatsApp.Значение;
			
		Иначе	
			
			ЗаполнитьЗначенияСвойств(МасивWhatsApp[0], МассивМобильныхТелефонов[0]);
			МасивWhatsApp[0].Вид = Справочники.смартПредопределенныеЗначения.ВидКонтактнойИнформацииWhatsApp.Значение;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1810 смарт: Фролов 08.05.2024

&НаКлиенте
&ИзменениеИКонтроль("Подключаемый_ОбновитьЛенту")
//++ #1813 смарт: Фролов 08.05.2024 //Доработки для удобства использования WhatsApp
Процедура смарт_Подключаемый_ОбновитьЛенту()

	ПараметрыЛенты = Новый Структура;
	ПараметрыЛенты.Вставить("Режим",				"ЛентаКонтакта");
	ПараметрыЛенты.Вставить("Объект",				Объект.Ссылка);
	ПараметрыЛенты.Вставить("АдресКартинок",		Лента_АдресКартинок);
	ПараметрыЛенты.Вставить("АдресКартинокФайлов",	Лента_АдресКартинокФайлов);
	ПараметрыЛенты.Вставить("Отбор",				Лента_Отбор);
	ПараметрыЛенты.Вставить("ОбъектовИстории",		Лента_КоличествоОбъектовИстории);
	ПараметрыЛенты.Вставить("Прокрутить",			Лента_Прокрутить);
	ПараметрыЛенты.Вставить("Пустая",				Не ЗначениеЗаполнено(Объект.Ссылка));

	ПолучателиЧата = Новый Массив;
	Лента_HTML = CRM_ЛентаСобытий.СформироватьЛенту(ПараметрыЛенты, ПолучателиЧата);

	Лента_Прокрутить = Ложь;

	// +Рарус alexpr
	//Если Лента_ЗначенияНастроек.ИспользоватьЧаты Тогда
	//	CRM_ЛентаСобытийКлиент.НастроитьОбластьВводаПослеФормированияЛенты(ПолучателиЧата, ЭтотОбъект);
	//	ВидимостьКомандыЧат = (БыстрыйВвод_ЧатПолучатели.Количество() > 0);
	//	Если БыстрыйВвод_ТекущийТипОбъекта = "Чат" И Не ВидимостьКомандыЧат Тогда
	//		ПереключитьСтраницуБыстрогоВвода("Примечание");
	//	КонецЕсли;
	//КонецЕсли;
	CRM_ЛентаСобытийКлиентСервер.ОбластьВводаНастритьВидимостьКомандПослеФормированияЛенты(ЭтотОбъект);

	Если Лента_ЗначенияНастроек.ИспользоватьЧаты Тогда

		ПараметрыДополнения = Новый Структура;
		ПараметрыДополнения.Вставить("Ссылка", Объект.Ссылка);
		ПараметрыДополнения.Вставить("УчетнаяЗапись", БыстрыйВвод_ЧатУчетнаяЗапись);
		ПараметрыДополнения.Вставить("ПартнерыКИ", ЭтотОбъект["КонтактнаяИнформацияОписаниеДополнительныхРеквизитов"]);

		МассивКонтактов = Новый Массив;
		МассивКонтактов.Добавить(Объект.Ссылка);
		ПараметрыДополнения.Вставить("МассивКонтактов", МассивКонтактов);

		CRM_КлиентыСервер.ДополнитьПолучателейЧата(ПолучателиЧата, ПараметрыДополнения);

		УчетныеЗаписиМессенджеров = CRM_КлиентыСервер.УчетныеЗаписиМессенджеров(БыстрыйВвод_ЧатВидКИ, Объект.Ссылка);
		CRM_ЛентаСобытийКлиентСервер.НастроитьОбластьВводаУчетныеЗаписиМессенджеров(УчетныеЗаписиМессенджеров, ЭтотОбъект);

		CRM_ЛентаСобытийКлиентСервер.НастроитьОбластьВводаПослеФормированияЛенты(ПараметрыЛенты, ПолучателиЧата, ЭтотОбъект);

	КонецЕсли;
	// -Рарус alexpr
	
	#Вставка
	Если ПолучателиЧата.Количество() > 0 Тогда
		
		Элементы.смартДекорацияНетПолучателейЧата.Видимость = Ложь;
		Элементы.БыстрыйВвод_ЧатПредставлениеПолучателя.Видимость = Истина;
		Элементы.БыстрыйВвод_ЧатПредставлениеУчетнойЗаписи.Видимость = Истина;
		Элементы.БыстрыйВвод_ЧатСодержание.Видимость = Истина;
		Элементы.БыстрыйВвод_КомандыЧат.Видимость = Истина;
		
	Иначе
		
		Элементы.смартДекорацияНетПолучателейЧата.Видимость = Истина;
		Элементы.БыстрыйВвод_ЧатПредставлениеПолучателя.Видимость = Ложь;
		Элементы.БыстрыйВвод_ЧатПредставлениеУчетнойЗаписи.Видимость = Ложь;
		Элементы.БыстрыйВвод_ЧатСодержание.Видимость = Ложь;
		Элементы.БыстрыйВвод_КомандыЧат.Видимость = Ложь;
		
	КонецЕсли;
	#КонецВставки
	
КонецПроцедуры //-- #1813 смарт: Фролов 08.05.2024

//++ #Б-1998 смарт: Лопато 27.01.2025 //Создание пользователя ИМ на основании договора поставки. Доработать метод отправки регистрации на сайт  
&НаКлиенте
Процедура смартЗарегистрироватьПользователяНаСайте(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("смартЗарегистрироватьПользователяНаСайтеЗавершение", ЭтотОбъект);
	ПроверкаВопросЗаписатьДанные(ОписаниеОповещения);
	
КонецПроцедуры //-- #Б-1998 смарт: Лопато 27.01.2025	

//++ #Б-1998 смарт: Лопато 27.01.2025 //Создание пользователя ИМ на основании договора поставки. Доработать метод отправки регистрации на сайт  
&НаКлиенте
Процедура смартЗарегистрироватьПользователяНаСайтеЗавершение(ПродолжитьВыполнение, ПараметрыВыполнения) Экспорт
	
	Если ПродолжитьВыполнение Тогда
		смартЗарегистрироватьПользователяНаСайтеНаСервере(Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-1998 смарт: Лопато 27.01.2025

//++ #Б-1998 смарт: Лопато 27.01.2025 //Создание пользователя ИМ на основании договора поставки. Доработать метод отправки регистрации на сайт  
&НаСервереБезКонтекста
Процедура смартЗарегистрироватьПользователяНаСайтеНаСервере(КонтактноеЛицо)

	смартИнтернетМагазин.ЗарегистрироватьПользователяНаСайте(КонтактноеЛицо);
	
КонецПроцедуры //-- #Б-1998 смарт: Лопато 27.01.2025

#КонецОбласти
